// 1)Вивести на екран всі числа від 1 до 10 за допомогою циклу while.

// 2)Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for.Якщо число парне, пропустити його за допомогою continue.

// 3)Вивести на екран таблицю множення числа 7 за допомогою циклу for.

// 4)Cтворити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.

// 5)Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.

// 6)Створити скрипт, який виводить на екран всі числа, які менші за n.Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.

// 7)За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
