// Що таке цикл?
// Види циклів (while, do...while,for,for...of)
// оператори break та continue
// Приклади

// while - ключове слово яке утворює цикл . Перекладається як поки
// While це цикл в якому перевіряється умова а потім виконується дія
// while - працює поки умова виконується === true
// данний цикл може бути безкінечним

// while потрібен  для нескінченних циклів
//

// counter має дорівнювати 10

let counter = 0;

// () - в круглих дужках записуємо умову за якої має виконатись наш цикл (якщо false то цикл не виконається якщо true цикл відпрацює)
// {} - тіло циклу(в тілі циклу  ми виконуємо нашу основну задачу) (записуємо логіку вирішення задачі)
// послідовність дії які призначені для багаторазового використання

// Ітерація - це коли тіло нашого циклу виконується один раз
//(Умова виходу з циклу) - Умова виходу з циклу (вираз що говорить нам про те чи буде ще виконуватись цикл чи ні)

// Лічильник (в нашому випадку лічильников є counter) - змінна,що зберігає поточну ітерацію(номер операції яка була виконана зараз)

// Виконання будь-якого циклу складається з декількох етапів
// 1) створення необхідних змінних
// 2)Перевірка умови виходу
// 3)Виконання тіла циклу
// 4)Оновлення значення змінної на кожній ітерації

while (counter < 10) {
  counter++; //
  console.log(counter);
}

// ++ - додавання 1
// -- - віднімання 1

// do ... while

// do...while
// ЗВичайний приклад де ми спочатку робимо потім думаємо

let password = "";

// do {
//   password = prompt("Введи пароль більше 5 символів");
// } while (password.length > 5);

console.log(password);

// for

const maxValue = 100;

// for - це цикл яким ви в основному будете користуватись для перебору масивів та отримання різноманітних данних
// Ключове слово for
// (condition ) - умови які мають виконуватись
// Перше в круглих дужках це лічильник(відповідає за отримання значення теперішньої ітерації)(index,iterator)
//Друге - це умова виходу при досягненні якої цикл буде зупинено
//Трете - пост-вираз,виконується після тіла циклу.Використовується для того щоб поновити значення лічильнака так як ми вказали
for (let i = 0; i < maxValue; i = i + 1) {
  if (i % 2 === 0) {
    // continue = дозволяє пропустити ітерацію
    console.log("Парні:", i);
    continue;
  }
  console.log("НЕпарні: ", i);
}

const number = 1000;

const user = 3;

for (let index = 0; index < 1000; index++) {
  if (index === user) {
    console.log("ти переможець");
    // break оператор який повністю зупиняє цикл
    break;
  }
  console.log(index);
}

// for...of потрібен для перебру данних без лічильника та без індекса
